# RemoveCropRegionShape Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..RemoveCropRegionShape Method
ViewCropRegionShapeManager Class See Also
---
Removes any non-rectangular boundary of the view's crop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RemoveCropRegionShape()
```

Visual Basic
---
```text
Public Sub RemoveCropRegionShape
```

Visual C++
---
```text
public:
void RemoveCropRegionShape()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The crop of the associated view is not permitted to have a non-rectangular shape. |

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace